// Написать программу,которая из имеющегося массива строк 
// формирует массив из строк, длина которых меньше
// либо равна 3 символа. Первоначальный массив можно ввести с 
// клавиатуры, либо задать на старте исключительно массивами.

// ["hello", "2","world", ":-)"] -> ["2", ":-)"]

string[] StringArray = new string(size);
string (i) = 3;

for (i = 0; i <= size; i++)
{
    if (i <= 3)
}
Console.WriteLine($"Массив с тремя и менее символами: ->{StringArray}");
{
    
else Console.WriteLine("Длина строк больше трёх");
}
    
